/*
🌸 𝗦𝗖𝗥𝗜𝗣𝗧 𝗜𝗡𝗙𝗢 🌸  
┌───────────────────────────────┐
│ 💫 𝗝𝘂𝗱𝘂𝗹 : Yurii-Md  
│ 👑 𝗖𝗿𝗲𝗮𝘁𝗼𝗿 : FallZx Infinity  
│ ⚠️ 𝗡𝗼𝘁𝗲 : Jangan hapus credit ini!  
│     Hargai creator dengan tetap mencantumkan nama.  
└───────────────────────────────┘
✨ Terima kasih telah menggunakan script ini!
*/
const fs = require('fs');
const chalk = require('chalk');
const { runtime } = require('./function');
const os = require("os")

exports.menu =  ( isPremium, time, sender, prefix, pushname) => {

return `\n💫 ʏᴜʀɪɪ-ᴍᴅ ʙᴏᴛ ᴍᴇɴᴜ 💫

ʜᴀʟᴏ~ ꜱᴀʏᴀ ʏᴜʀɪɪ-ᴍᴅ 🤖
ʙᴏᴛ ɪɴɪ ᴅɪʙᴜᴀᴛ ᴍᴇɴɢɢᴜɴᴀᴋᴀɴ ɴᴏᴅᴇᴊꜱ & ᴊᴀᴠᴀꜱᴄʀɪᴘᴛ
ᴅɪᴋᴇᴍʙᴀɴɢᴋᴀɴ ᴏʟᴇʜ ᴛᴜᴀɴ ꜰᴀʟʟᴢx ɪɴꜰɪɴɪᴛʏ ⚡

━━━━━━━━━━━━━━━━━━
📜 ɪɴꜰᴏ ʙᴏᴛ
👤 ᴄʀᴇᴀᴛᴏʀ : ꜰᴀʟʟᴢx ɪɴꜰɪɴɪᴛʏ
🤖 ᴊᴇɴɪꜱ : ʏᴜʀɪɪ-ᴍᴅ
🧩 ᴠᴇʀꜱɪᴏɴ : 1.0 ʙᴀꜱᴇꜱ
⚙️ ᴏᴘᴛɪᴍᴀʟɪꜱᴀꜱɪ : ʜɪɢʜ ᴘᴇʀꜰᴏʀᴍᴀɴᴄᴇ
━━━━━━━━━━━━━━━━━━
🎯 ᴍᴇɴᴜ-sɪᴍᴘʟᴇ
│ ✦ .ᴛɪᴋᴛᴏʟ – ᴅʟ ᴠɪᴅ ᴛᴛ
│ ✦ .ᴛᴡɪᴛᴛᴇʀᴅʟ – ᴅʟ ᴠɪᴅ x
│ ✦ .ꜱᴛɪᴄᴋᴇʀ – ᴊᴀᴅɪᴋᴀɴ ꜱᴛɪᴋᴇʀ
│ ✦ .ǫᴄ – ʙᴜᴀᴛ ǫᴜᴏᴛᴇ-ᴄᴀʀᴅ
━━━━━━━━━━━━━━━━━━
\`ᴄᴏᴅᴇᴅ ʙʏ ꜰᴀʟʟᴢx ɪɴꜰɪɴɪᴛʏ ⚡\``
}

let file = require.resolve(__filename);
fs.watchFile(file, () => {
    fs.unwatchFile(file);
    console.log(chalk.yellow(`New ${__filename}`));
    delete require.cache[file];
    require(file);
});
process.on('uncaughtException', console.error);